{
  "questions": [
    "If you could travel anywhere in the world, where would you go?",
    "What’s the most random fact you know?",
    "What’s the most spontaneous thing you’ve ever done?",
    "If you could only eat one food for the rest of your life, what would it be?",
    "What have you always wanted to try, but haven’t yet?",
    "What’s the best concert or live event you’ve ever been to?",
    "What’s the weirdest thing you believed as a kid?",
    "Where was your favorite holiday and why?",
    "If you could switch jobs with anyone for a day, what would you do?",
    "If you could live in any time period, which would you choose?",
    "What’s your idea of a perfect date?",
    "Do you believe in love at first sight?",
    "What’s something small that always makes your day better?",
    "What’s your love language?",
    "Have you ever had a crush on a fictional character?",
    "What’s the most romantic thing someone has done for you?",
    "What song makes you think of love?",
    "What’s your biggest turn-on?",
    "What’s your biggest turn-off?",
    "What’s a dealbreaker for you in a relationship?",
    "Would you rather go out or stay in on a Friday night?",
    "How do you usually spend your weekends?",
    "What’s your favorite way to relax?",
    "What kind of movies do you love watching together?",
    "What’s your favorite romantic movie?",
    "What’s a perfect weekend getaway for you?",
    "Have you ever had a long-distance relationship?",
    "What do you find most attractive in someone?",
    "Do you believe in soulmates?",
    "How do you show someone you care about them?",
    "What’s something people often misunderstand about you?",
    "What’s your favorite memory from your childhood?",
    "What’s your biggest dream in life?",
    "Do you enjoy surprises or not?",
    "What’s something you’re really passionate about?",
    "What kind of music makes you feel the most alive?",
    "Do you enjoy giving or receiving gifts more?",
    "How do you handle conflict in a relationship?",
    "What’s the best advice you’ve ever received about love?",
    "Do you believe everything happens for a reason?",
    "Have you ever had a crush on a friend?",
    "What’s your biggest fear in a relationship?",
    "How do you usually express affection?",
    "Do you think opposites attract or birds of a feather flock together?",
    "What’s your favorite thing about dating?",
    "What’s something you’ve learned from past relationships?",
    "How do you feel about PDA (public displays of affection)?",
    "What does trust mean to you?",
    "What’s one word your ex would use to describe you?",
    "What’s something romantic you’ve always wanted to do?",
    "Do you believe people can change?",
    "What’s something that instantly makes you smile?",
    "What’s your guilty pleasure?",
    "What’s a weird habit you have?",
    "If we could teleport anywhere right now, where would we go?",
    "Do you like slow dancing even if there’s no music?",
    "What’s your biggest goal right now?",
    "What makes you feel appreciated?",
    "What’s your zodiac sign, and do you believe in astrology?",
    "What’s your most memorable birthday?",
    "What’s something new you’ve always wanted to learn?",
    "Do you believe in fate?",
    "If your life was a movie, what would it be called?",
    "What’s your go-to comfort food?",
    "What’s the most adventurous thing you’ve done so far?",
    "How do you usually handle stress?",
    "What’s your favorite thing to do with someone you love?",
    "If we had a free day with no responsibilities, what would we do?",
    "What’s your biggest insecurity?",
    "What’s the best compliment you’ve ever received?",
    "Do you believe in second chances?",
    "How do you feel about marriage?",
    "What’s something that makes you nervous on a first date?",
    "Have you ever written a love letter?",
    "Do you enjoy cuddling?",
    "What’s your favorite type of hug?",
    "How do you know when you’re in love?",
    "What’s a silly thing that always makes you laugh?",
    "If you had to describe yourself in 3 words, what would they be?",
    "What’s something you’ve never told anyone?",
    "Would you rather have a big wedding or something small and intimate?",
    "Do you believe in destiny or making your own path?",
    "What’s the best date you’ve ever had?",
    "What’s the worst date you’ve ever been on?",
    "What do you value most in a partner?",
    "What’s something that instantly gives you butterflies?",
    "What’s a red flag you always watch for?",
    "What’s a green flag that attracts you right away?",
    "What’s your favorite couple activity?",
    "What kind of flirting works best on you?",
    "If you had a love superpower, what would it be?",
    "How important is physical attraction to you?",
    "What kind of future do you imagine with a partner?",
    "Would you rather find love quickly or take your time?",
    "What’s one thing you want in your next relationship that you didn’t have in the last?",
    "How do you keep the spark alive in a relationship?",
    "What’s a song that reminds you of falling in love?",
    "What’s a small gesture that means a lot to you?",
    "Do you think you’re a romantic person?",
    "Would you rather be single forever or in a toxic relationship?",
    "What’s your biggest pet peeve on a date?",
    "What does a healthy relationship mean to you?",
    "If you could plan the perfect date night, what would it include?",
    "How do you define love?"
  ],
  "previous_q": [
    "45",
    "88",
    "43",
    "26",
    "27",
    "2",
    "23",
    "25",
    "69",
    "28",
    "11",
    "51",
    "66",
    "24",
    "7",
    "35",
    "38",
    "55",
    "61",
    "97",
    "68",
    "102",
    "30",
    "22",
    "83",
    "64",
    "89",
    "37",
    "10",
    "54",
    "15",
    "4",
    "20",
    "96",
    "12",
    "52",
    "80",
    "56",
    "58",
    "9",
    "100",
    "29",
    "67",
    "32",
    "76",
    "50",
    "44",
    "87",
    "5",
    "16",
    "0",
    "82",
    "92",
    "49",
    "63",
    "53",
    "21",
    "72",
    "70",
    "31",
    "60",
    "81",
    "78",
    "65",
    "42",
    "91",
    "74",
    "41",
    "48",
    "95",
    "3",
    "101",
    "40",
    "19",
    "59",
    "93",
    "18",
    "84",
    "103",
    "99",
    "6",
    "90",
    "62",
    "75",
    "33",
    "94",
    "86",
    "47",
    "36"
  ]
}