{
  "questions": [
    "Is love at first sight real? (Yes / No)",
    "Would you rather get a good morning text or a good night call?",
    "Is texting every day in a relationship a must? (Yes / No)",
    "Would you date someone who doesn’t like your favorite music?",
    "Is it okay to date your best friend?",
    "What's more romantic? (Candlelit dinner / Stargazing)",
    "Do opposites really attract? (Yes / No)",
    "Would you rather go on a beach date or mountain getaway?",
    "Are long-distance relationships worth it? (Yes / No)",
    "Would you date someone who’s a gamer?",
    "Should your partner be your best friend?",
    "First date idea: (Coffee / Dinner / Movie / Walk in the park)",
    "Who should make the first move? (Guy / Girl / Doesn’t matter)",
    "Are you more into: (Personality / Looks)",
    "Do you believe in soulmates? (Yes / No / Not sure)",
    "Would you rather receive love letters or surprise gifts?",
    "Is flirting while in a relationship cheating? (Yes / No / Depends)",
    "Would you rather go on a blind date or online date?",
    "Should you share your phone password with your partner? (Yes / No)",
    "Is a sense of humor more important than looks? (Yes / No)",
    "Would you date someone who’s never been in a relationship before?",
    "What’s more important? (Trust / Communication / Passion)",
    "Is jealousy cute or toxic? (Cute / Toxic / Depends)",
    "Would you prefer a clingy partner or a distant one?",
    "Is it okay to still be friends with your ex? (Yes / No / Only sometimes)",
    "Would you rather date someone shy or outgoing?",
    "Are dinner dates overrated? (Yes / No)",
    "Should couples share social media passwords? (Yes / No)",
    "Do you believe in love lasting forever? (Yes / No / Only sometimes)",
    "Are pet names cute or cringe? (Cute / Cringe / Depends on the name)",
    "Would you date someone with a very different lifestyle?",
    "What's more attractive? (Confidence / Kindness)",
    "Is taking a break ever a good idea in a relationship?",
    "What’s better on a date? (Talking for hours / Doing something fun)",
    "Would you date someone who’s still friends with their ex?",
    "Is it okay to talk about your ex with your current partner?",
    "Would you date someone who doesn’t want kids?",
    "Do you prefer slow burns or love at first sight?",
    "Is ghosting ever justified? (Yes / No / Only in extreme cases)",
    "Would you rather receive a playlist or a handwritten letter?",
    "Can two people be ‘too similar’ to work as a couple?",
    "Would you rather be single forever or settle for less than you deserve?",
    "Is being busy a valid excuse for lack of communication?",
    "Would you rather your partner be a great cook or great kisser?",
    "Is physical touch your main love language? (Yes / No / Not sure)",
    "Would you go on a double date with your best friend?",
    "Would you date someone who’s never watched your favorite show?",
    "Are online relationships real relationships?",
    "Can you fall in love just by chatting online?",
    "Would you rather get a kiss on the forehead or a long hug?",
    "Do you believe love gets stronger with time?",
    "Do you prefer constant communication or space in a relationship?",
    "Is it okay to date someone with very different political views?",
    "Would you rather have a funny partner or a smart one?",
    "Would you move to another country for love?",
    "Is marriage a goal in your dating life? (Yes / No / Not sure)",
    "Should couples have shared hobbies? (Yes / No)",
    "Would you date someone who doesn’t believe in marriage?",
    "Is being single underrated? (Yes / No)",
    "What matters more: (Shared values / Shared interests)",
    "Are love languages real or just a trend?",
    "Would you prefer a short but intense love or a long and peaceful one?",
    "Should couples have alone time regularly?",
    "Would you rather cuddle or kiss?",
    "Do you prefer texting or calling your partner?",
    "Should your partner like your friends? (Yes / No / Doesn’t matter)",
    "What’s worse on a date? (Being late / Constant phone use)",
    "Are dating apps a good way to meet someone? (Yes / No)",
    "Would you rather date someone taller or shorter?",
    "Is playing hard to get attractive or annoying?",
    "Do you think zodiac compatibility matters in dating?",
    "Should couples celebrate monthly anniversaries?",
    "Is it okay to look through your partner’s phone?",
    "Would you rather go on a spontaneous trip or plan everything?",
    "Would you date someone with a very different sense of humor?",
    "Is texting back late a red flag?",
    "Is a first date kiss okay or too soon?",
    "Should you talk about your future early in a relationship?",
    "Is saying ‘I love you’ in the first month too soon?",
    "Would you rather get married young or late?",
    "Do you like public displays of affection? (Yes / No / A little)",
    "Would you be okay dating someone from a different culture?",
    "What’s worse: (No chemistry / No communication)",
    "Are you more into cute dates or wild adventures?",
    "Would you rather find love or win a million dollars?",
    "Do you think guys should always pay for the first date?",
    "Would you rather date a night owl or early bird?",
    "Are you open to polyamorous relationships? (Yes / No / Not sure)",
    "Would you date someone who lives with their parents?",
    "Is dating more fun or stressful?",
    "Do you believe in taking things slow or diving in fast?",
    "Would you rather have a short text convo or a deep voice chat?",
    "Would you date someone without social media?",
    "Is it more romantic to receive flowers or a love letter?",
    "Do you prefer face-to-face confession or over text?",
    "Should love be logical or emotional?",
    "Would you date someone who doesn’t believe in love?"
  ],
  "previous_q": [
    "22",
    "2",
    "45",
    "23",
    "35",
    "75",
    "70",
    "62",
    "20",
    "83",
    "21",
    "41",
    "66",
    "71",
    "74",
    "28",
    "63",
    "78",
    "10",
    "24",
    "3",
    "51",
    "18",
    "54",
    "19",
    "68",
    "73",
    "43",
    "4",
    "57",
    "60",
    "40",
    "7",
    "16",
    "5",
    "11",
    "84",
    "79",
    "8",
    "91",
    "14",
    "87",
    "9",
    "30",
    "6",
    "58",
    "34",
    "0",
    "61",
    "38",
    "36"
  ]
}