{
  "truths": [
    "What's the most romantic thing you've ever done for someone?",
    "Have you ever had a crush on a friend's partner?",
    "What’s your idea of a perfect date?",
    "When was the last time you cried over someone?",
    "What’s the longest relationship you’ve been in?",
    "What’s the most embarrassing thing you’ve done on a date?",
    "Do you believe in love at first sight?",
    "Who was your first kiss, and how old were you?",
    "What’s your biggest fear when it comes to relationships?",
    "What’s the most spontaneous thing you’ve ever done for love?",
    "If you could go out with anyone in this room, who would it be?",
    "What’s one thing about your dating history you wish people didn’t know?",
    "What’s the worst date you’ve ever been on?",
    "Have you ever ghosted someone? Why?",
    "What’s the most flirtatious thing you’ve ever done?",
    "What’s your favorite physical feature on your current or past partner(s)?",
    "What’s the most awkward breakup you’ve experienced?",
    "What’s something romantic you’d never do?",
    "What’s one quality you look for in every potential partner?",
    "Have you ever fallen for someone you initially disliked?",
    "What’s the most surprising thing that has attracted you to someone?",
    "Would you rather be single forever or be stuck in a bad relationship?",
    "What’s your dealbreaker in a relationship?",
    "How long did it take you to get over your last ex?",
    "What’s the most ridiculous lie you’ve told to avoid a date?",
    "What’s your favorite memory with a past partner?",
    "What’s one thing you always notice first about someone you find attractive?",
    "What’s the best compliment you’ve ever received from a partner?",
    "Have you ever dated someone significantly older or younger than you?",
    "What’s the most romantic gesture you’ve received?",
    "What’s one thing you dislike about modern dating?",
    "What’s the most unusual place you’ve gone on a date?",
    "What’s your opinion on public displays of affection (PDA)?",
    "What’s one thing you regret saying to an ex?",
    "If you had to choose between texting or calling your partner, which would you pick?",
    "What’s the most unromantic thing someone has done for you?",
    "What’s the most romantic movie moment that made you swoon?",
    "What’s the biggest misconception people have about you in relationships?",
    "What’s one thing you’re insecure about when it comes to dating?",
    "What’s the sweetest text message you’ve ever sent or received?",
    "What’s your biggest pet peeve in relationships?",
    "What’s the most cringe-worthy pickup line you’ve heard?",
    "What’s one thing you’d change about your dating life if you could?",
    "What’s the best advice you’ve ever received about love?",
    "What’s one thing you wish people knew before they started dating you?",
    "What’s the most unexpected way you’ve met someone you liked?",
    "What’s your favorite type of love language?"
  ],
  "dares": [
    "Send a flirty GIF in chat.",
    "Change your nickname to “Hopeless Romantic” for 10 minutes.",
    "Call someone you like and say something embarrassing.",
    "Send a voice note singing a cheesy love song.",
    "Describe your ideal date without using any adjectives.",
    "Confess something funny about yourself in the chat.",
    "Take a selfie making your best “seductive” face and share it.",
    "Act out your best impression of a jealous partner.",
    "Type out the cheesiest pickup line you can think of and send it in chat.",
    "Post a picture of your favorite snack and caption it as if it’s your dating profile.",
    "Send a screenshot of your phone wallpaper.",
    "Message someone random and ask them what their favorite ice cream flavor is.",
    "Dance to a slow jam for 30 seconds and record it.",
    "Write a short poem about love and post it in the chat.",
    "Go live for 2 minutes and pretend you’re auditioning for a rom-com.",
    "Admit something embarrassing you did while flirting.",
    "Make up a fake story about how you met your “future spouse.”",
    "Send a compliment to the person above you in the chat.",
    "Send a voice note pretending to be on a terrible date.",
    "Screen record yourself trying to fold a piece of paper into a heart shape.",
    "Admit the silliest reason you’ve ever rejected someone.",
    "Put a dating app bio together using only emojis and post it.",
    "Answer the next 5 questions you get with overly dramatic flair.",
    "Reenact your favorite movie proposal scene.",
    "Share your top three turn-offs in a partner.",
    "Send a voice note acting out a soap opera breakup scene.",
    "Tell us what your dream wedding would look like in five sentences or less.",
    "Pretend to be a matchmaker and pair two people in the chat based on their usernames.",
    "Change your profile picture to something related to romance for 5 minutes.",
    "Send a screenshot of your search history without context.",
    "Write a love letter to your favorite food.",
    "Act like you’re proposing to an inanimate object for 30 seconds.",
    "Mention one thing you’d do differently on your last date.",
    "Challenge someone else in the chat to a “who’s more romantic” contest.",
    "Send a screenshot of your last text conversation (black out names).",
    "Record yourself doing an exaggerated evil laugh like a villain breaking up with someone.",
    "Ask someone in the chat a question you’d ask on a first date.",
    "React dramatically to the last love-related tweet/post you see online.",
    "Suggest a fun double date idea for two random people in the chat.",
    "Send a video of yourself saying “I love you” in the most over-the-top way possible.",
    "Pick a celebrity couple and explain why they’re soulmates.",
    "Draw a quick doodle of your ideal date location and share it.",
    "Perform a karaoke version of your favorite breakup song.",
    "Admit the weirdest thing you’ve ever Googled about relationships.",
    "Give someone in the chat a new romantic nickname and call them that for 5 minutes."
  ],
  "previous_truths": [
    "34",
    "20",
    "27",
    "21",
    "39",
    "1",
    "16",
    "12",
    "6",
    "25",
    "18",
    "2",
    "28",
    "46",
    "32"
  ],
  "previous_dares": [
    "19",
    "10",
    "15",
    "26",
    "9",
    "39",
    "7",
    "25",
    "12"
  ]
}